12/data/attachments/86c91e01f0bd2ee1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_19249d94-f068-4de5-aefb-eeb0eb80a5e8</nif:username>
            <nif:friendToBeAdded>Melvin_continue_Friend_66307_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>